app/Http/Controllers/UsersController.php

    public function index()
    {
        $users = User::where('id', '!=', auth()->user()->id)->get();
---
select * from `users` where `id` != 51